/*
 * To change this template, choose Tools | Templates
 * and open the template in the editor.
 */
package ie;

/**
 *
 * @author Administrator
 */
public class DivideText {
   public static String classfy=new String();
    public static String divide(String text_temp){
	
	int Society=0;
	int Nation=0;
	int Inter=0;
	
        String[] society={
                    "女童","女大学生","自杀","同学","聊天","整形","女子","入狱","河北农业大学","车震门","佛山","淫乱",
                    "妇女","娼妓","劫财","劫色","女儿","女孩","孕妇","产妇","出生","初中","小学","高中",
                    "大学","女友","少女","女人","民工","酒驾","警察","女警","妻子","男婴","女婴","男童",
                    "男子","嫖娼","男孩","男友","学生","本科","博士","捞尸","企业","老师","讲师","教授",
                    "专家","整容","整形","手术","夫妻","肾","自杀","强奸","抢劫","虐待","性奴","校长",
                    "主任","打人","煎饼","宝马哥","特警","交通事故","事故","人流","早孕","医院","伺机","筹款",
                    "别墅","农民工","子弟","老人","富二代","官二代","失踪","牙医","医生","护士","看管","看守",
                    "嫉妒","儿童","性骚扰","性幻想","讲台","蚁族","土地","借贷","房产","穷人","地铁","飞机",
                    "故障","援助","维修","灾难","冬天","干旱","冰淇淋","硕士","举报","城管","联防队","交警",
                     "春运","地铁"
        };
	
	String[] nation={
			"北京","河北","黑龙江","哈尔滨","青岛","辽宁","济宁","吉宁","山东","西藏","河南","湖北",
                        "武汉","邯郸","江西","南昌","湖南","长沙","江苏","浙江","上海","苏州","杭州","四川",
                        "成都","重庆","云南","昆明","广西","广东","东莞","广州","发改委","质监局","市民","供应",
                        "党员","陕西","山西","西安","干部","党委书记","市委书记","市长","省委书记","省长","省","中国网民",
                        "香港","澳门","党委书记","衣加衣","中央","领导","反腐","倡廉","官员","问责","双规","司法",
                        "税务","税改","房产税","黑金","铁道部","工信部","药监局","保健品","胡锦涛","温家宝","习近平","吴邦国",
                        "漠河","长征","火箭","贸易","出口","进口","GDP","关税","茅台","县","市","市区",
                        "城区","官员","地震","贪官","博物馆","矿难","煤老板","领导","谈话","讲话","供水","供电",
                        "公务员"
	};
	String[] inter={
                           "日本","韩国","日韩","韩日","朝鲜","金正日","李明博","朝韩","首相","金正恩"
                           ,"金正银","俄罗斯","普京","梅德韦杰夫","特务","间谍","新加坡","泰国","马来西亚",
                           "欧洲","欧盟","法国","WTO","萨科奇","希腊","德国","德国总理","法国总统","英国","布朗","冰岛","美国",
                           "奥巴马","政策","联合国","埃及","泰国","南非","伊拉克","车臣","利比亚","中东","阿拉伯",
                           "白宫","伊丽莎白","布什","墨西哥","南美","北美","非洲","澳大利亚","太平洋","台湾","印度","巴基斯坦",
			"和平","扩张","领土","国家","主权","统一",
			"军队","军种","特种兵","陆军","海军","空军","核武器","核战争","暴乱","执法","开战","歼灭",
			"战机","钓鱼岛","炸弹","导弹","军方","航母","挑衅","联盟","盟军","国防",
			"国家安全","海岸线","海防","海战","国防部","和平","两军关系","亚太","一战","二战",
			"印尼关系","两军关系","中印"
			
	};
 
	for(int i=0;i<society.length;i++){
		if(text_temp.indexOf(society[i])>=0){
			Society++;
		}
	}
	
	
	for(int i=0;i<nation.length;i++){
		if(text_temp.indexOf(nation[i])>=0){
			Nation++;
		}
	}
	for(int i=0;i<inter.length;i++){
		if(text_temp.indexOf(inter[i])>=0){
			Inter++;
		}
	}
	
	if(Society==0&&Nation==0&&Inter==0){
		classfy="else";
	}
	else if(Society>=Math.max(Nation,Inter)){
		classfy="Society";

	}
	else if(Nation>=Math.max(Society,Inter)){
		classfy="Nation";

	}
	else if(Inter>=Math.max(Nation,Society)){
		classfy="Inter";

	}
	

	return classfy;
}

}
